zhangfei0312/HC32F401_ProjectDemo/FreeRTOS/Libraries/CMSIS/startup/startup_hc32f40_41xxx.s
;*******************************************************************************
;*******************************************************************************

; Amount of memory (in bytes) allocated for Stack
; Tailor this value to your application needs
; <h> Stack Configuration
;   <o> Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Stack_Size      EQU     0x00004000

                AREA    STACK, NOINIT, READWRITE, ALIGN=3
Stack_Mem       SPACE   Stack_Size
__initial_sp


; <h> Heap Configuration
;   <o>  Heap Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Heap_Size       EQU     0x00000200

                AREA    HEAP, NOINIT, READWRITE, ALIGN=3
__heap_base
Heap_Mem        SPACE   Heap_Size
__heap_limit

                PRESERVE8
                THUMB


; Vector Table Mapped to Address 0 at Reset
                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size

__Vectors       DCD     __initial_sp               ; Top of Stack
                DCD     Reset_Handler              ; Reset Handler
                DCD     NMI_Handler                ; NMI Handler
                DCD     HardFault_Handler          ; Hard Fault Handler
                DCD     MemManage_Handler          ; MPU Fault Handler
                DCD     BusFault_Handler           ; Bus Fault Handler
                DCD     UsageFault_Handler         ; Usage Fault Handler
                DCD     0                          ; Reserved
                DCD     0                          ; Reserved
                DCD     0                          ; Reserved
                DCD     0                          ; Reserved
                DCD     SVC_Handler                ; SVCall Handler
                DCD     DebugMon_Handler           ; Debug Monitor Handler
                DCD     0                          ; Reserved
                DCD     PendSV_Handler             ; PendSV Handler
                DCD     SysTick_Handler            ; SysTick Handler

                ; External Interrupts
                DCD     WWDG_IRQHandler                   ; Window WatchDog                                        
                DCD     PVD_IRQHandler                    ; PVD through EXTI Line detection                        
                DCD     TAMP_STAMP_IRQHandler             ; Tamper and TimeStamps through the EXTI line            
                DCD     RTC_WKUP_IRQHandler               ; RTC Wakeup through the EXTI line                       
                DCD     FLASH_IRQHandler                  ; FLASH                                           
                DCD     RCC_IRQHandler                    ; RCC                                             
                DCD     EXTI0_IRQHandler                  ; EXTI Line0                                             
                DCD     EXTI1_IRQHandler                  ; EXTI Line1                                             
                DCD     EXTI2_IRQHandler                  ; EXTI Line2                                             
                DCD     EXTI3_IRQHandler                  ; EXTI Line3                                             
                DCD     EXTI4_IRQHandler                  ; EXTI Line4                                             
                DCD     DMA1_Stream0_IRQHandler           ; DMA1 Stream 0                                   
                DCD     DMA1_Stream1_IRQHandler           ; DMA1 Stream 1                                   
                DCD     DMA1_Stream2_IRQHandler           ; DMA1 Stream 2                                   
                DCD     DMA1_Stream3_IRQHandler           ; DMA1 Stream 3                                   
                DCD     DMA1_Stream4_IRQHandler           ; DMA1 Stream 4                                  
                DCD     DMA1_Stream5_IRQHandler           ; DMA1 Stream 5                                   
                DCD     DMA1_Stream6_IRQHandler           ; DMA1 Stream 6                                   
                DCD     ADC_IRQHandler                    ; ADC1, ADC2 and ADC3s                            
                DCD     RFU1_IRQHandler                	  ; Reserved                                               
                DCD     RFU2_IRQHandler               	  ; Reserved                                                
                DCD     CAN1_INT0_IRQHandler              ; CAN1 INT0                                               
                DCD     CAN1_INT1_IRQHandler              ; CAN1 INT1                                              
                DCD     EXTI9_5_IRQHandler                ; External Line[9:5]s                                    
                DCD     TIM1_BRK_IRQHandler          	  ; TIM1 Break                   
                DCD     TIM1_UP_IRQHandler          	  ; TIM1 Update                 
                DCD     TIM1_TRG_COM_IRQHandler           ; TIM1 Trigger and Commutation 
                DCD     TIM1_CC_IRQHandler                ; TIM1 Capture Compare                                   
                DCD     TIM2_IRQHandler                   ; TIM2                                            
                DCD     TIM3_IRQHandler                   ; TIM3                                            
                DCD     TIM4_IRQHandler                   ; TIM4                                            
                DCD     I2C1_EV_IRQHandler                ; I2C1 Event                                             
                DCD     RFU3_IRQHandler                   ; Reserved                                            
                DCD     I2C2_EV_IRQHandler                ; I2C2 Event                                             
                DCD     RFU4_IRQHandler                	  ; Reserved                                               
                DCD     SPI1_IRQHandler                   ; SPI1                                            
                DCD     SPI2_IRQHandler                   ; SPI2                                            
                DCD     USART1_IRQHandler                 ; USART1                                          
                DCD     USART2_IRQHandler                 ; USART2                                          
                DCD     USART3_IRQHandler                 ; USART3                                          
                DCD     EXTI15_10_IRQHandler              ; External Line[15:10]s                                  
                DCD     RTC_Alarm_IRQHandler              ; RTC Alarm (A and B) through EXTI Line                  
                DCD     USBWakeUp_IRQHandler              ; USB Wakeup through EXTI line                        
                DCD     TIM8_BRK_IRQHandler         	  ; TIM8 Break               
                DCD     TIM8_UP_IRQHandler                ; TIM8 Update                
                DCD     TIM8_TRG_COM_IRQHandler		      ; TIM8 Trigger and Commutation
                DCD     TIM8_CC_IRQHandler                ; TIM8 Capture Compare                                   
                DCD     DMA1_Stream7_IRQHandler           ; DMA1 Stream7                                           
                DCD     FSMC_IRQHandler                   ; FSMC                                            
                DCD     SDIO_IRQHandler                   ; SDIO                                            
                DCD     TIM5_IRQHandler                   ; TIM5                                          
                DCD     SPI3_IRQHandler                   ; SPI3                                            
                DCD     UART4_IRQHandler                  ; UART4                                           
                DCD     UART5_IRQHandler                  ; UART5                                           
                DCD     TIM6_IRQHandler               	  ; TIM6                   
                DCD     TIM7_IRQHandler                   ; TIM7                   
                DCD     TIM9_IRQHandler           		  ; TIM9                                
                DCD     TIM10_IRQHandler           		  ; TIM10                                   
                DCD     RFU5_IRQHandler           		  ; Reserved                                  
                DCD     VC0_IRQHandler           		  ; VC0                                   
                DCD     VC1_IRQHandler           		  ; VC1                                
                DCD     VC2_IRQHandler                    ; VC2                                        
                DCD     VC_Wakeup_IRQHandler              ; VC Wakeup                      
                DCD     RFU6_IRQHandler           		  ; Reserved                                                
                DCD     RFU7_IRQHandler           		  ; Reserved                                               
                DCD     RFU8_IRQHandler           		  ; Reserved                                               
                DCD     RFU9_IRQHandler           		  ; Reserved                                               
                DCD     USB_LP_IRQHandler                 ; USB LP                                   
                DCD     USB_HP_IRQHandler           	  ; USB HP                                   
                DCD     RFU10_IRQHandler           		  ; Reserved                                  
                DCD     RFU11_IRQHandler           		  ; Reserved                                
                DCD     RFU12_IRQHandler           		  ; Reserved                                        
                DCD     RFU13_IRQHandler           		  ; Reserved                                              
                DCD     RFU14_IRQHandler           		  ; Reserved                                            
                DCD     RFU15_IRQHandler           		  ; Reserved                     
                DCD     RFU16_IRQHandler           		  ; Reserved                   
                DCD     RFU17_IRQHandler           		  ; Reserved                    
                DCD     RFU18_IRQHandler           		  ; Reserved                                     
                DCD     RFU19_IRQHandler           		  ; Reserved                                          
                DCD     RFU20_IRQHandler           		  ; Reserved                                 
                DCD     MOU_IRQHandler               	  ; MOU
                DCD     FPU_IRQHandler                    ; FPU
                                         
__Vectors_End

__Vectors_Size  EQU  __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY

