zhangfei0312/HC32F401_ProjectDemo/FreeRTOS/Libraries/CMSIS/startup/startup_hc32f40_41xxx.s
; Reset handler
Reset_Handler    PROC
                 EXPORT  Reset_Handler             [WEAK]
        IMPORT  SystemInit
        IMPORT  __main

                 LDR     R0, =SystemInit
                 BLX     R0
                 LDR     R0, =__main
                 BX      R0
                 ENDP

; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler                [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler          [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler          [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler           [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler         [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler                [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler           [WEAK]
                B       .
                ENDP
PendSV_Handler  PROC
                EXPORT  PendSV_Handler             [WEAK]
                B       .
                ENDP
SysTick_Handler PROC
                EXPORT  SysTick_Handler            [WEAK]
                B       .
                ENDP

Default_Handler PROC

                EXPORT  WWDG_IRQHandler                   [WEAK]                                        
                EXPORT  PVD_IRQHandler                    [WEAK]                      
                EXPORT  TAMP_STAMP_IRQHandler             [WEAK]         
                EXPORT  RTC_WKUP_IRQHandler               [WEAK]                     
                EXPORT  FLASH_IRQHandler                  [WEAK]                                         
                EXPORT  RCC_IRQHandler                    [WEAK]                                            
                EXPORT  EXTI0_IRQHandler                  [WEAK]                                            
                EXPORT  EXTI1_IRQHandler                  [WEAK]                                             
                EXPORT  EXTI2_IRQHandler                  [WEAK]                                            
                EXPORT  EXTI3_IRQHandler                  [WEAK]                                           
                EXPORT  EXTI4_IRQHandler                  [WEAK]                                            
                EXPORT  DMA1_Stream0_IRQHandler           [WEAK]                                
                EXPORT  DMA1_Stream1_IRQHandler           [WEAK]                                   
                EXPORT  DMA1_Stream2_IRQHandler           [WEAK]                                   
                EXPORT  DMA1_Stream3_IRQHandler           [WEAK]                                   
                EXPORT  DMA1_Stream4_IRQHandler           [WEAK]                                   
                EXPORT  DMA1_Stream5_IRQHandler           [WEAK]                                   
                EXPORT  DMA1_Stream6_IRQHandler           [WEAK]                                   
                EXPORT  ADC_IRQHandler                    [WEAK]                         
                EXPORT  RFU1_IRQHandler                	  [WEAK]                                                
                EXPORT  RFU2_IRQHandler               	  [WEAK]                                               
                EXPORT  CAN1_INT0_IRQHandler              [WEAK]                                                
                EXPORT  CAN1_INT1_IRQHandler              [WEAK]                                                
                EXPORT  EXTI9_5_IRQHandler                [WEAK]                                    
                EXPORT  TIM1_BRK_IRQHandler          	  [WEAK]                  
                EXPORT  TIM1_UP_IRQHandler          	  [WEAK]                
                EXPORT  TIM1_TRG_COM_IRQHandler     	  [WEAK] 
                EXPORT  TIM1_CC_IRQHandler                [WEAK]                                   
                EXPORT  TIM2_IRQHandler                   [WEAK]                                            
                EXPORT  TIM3_IRQHandler                   [WEAK]                                            
                EXPORT  TIM4_IRQHandler                   [WEAK]                                            
                EXPORT  I2C1_EV_IRQHandler                [WEAK]                                             
                EXPORT  RFU3_IRQHandler                	  [WEAK]                                             
                EXPORT  I2C2_EV_IRQHandler                [WEAK]                                            
                EXPORT  RFU4_IRQHandler                	  [WEAK]                                               
                EXPORT  SPI1_IRQHandler                   [WEAK]                                           
                EXPORT  SPI2_IRQHandler                   [WEAK]                                            
                EXPORT  USART1_IRQHandler                 [WEAK]                                          
                EXPORT  USART2_IRQHandler                 [WEAK]                                          
                EXPORT  USART3_IRQHandler                 [WEAK]                                         
                EXPORT  EXTI15_10_IRQHandler              [WEAK]                                  
                EXPORT  RTC_Alarm_IRQHandler              [WEAK]                  
                EXPORT  USBWakeUp_IRQHandler              [WEAK]                        
                EXPORT  TIM8_BRK_IRQHandler         	  [WEAK]                 
                EXPORT  TIM8_UP_IRQHandler          	  [WEAK]                 
                EXPORT  TIM8_TRG_COM_IRQHandler     	  [WEAK] 
                EXPORT  TIM8_CC_IRQHandler                [WEAK]                                   
                EXPORT  DMA1_Stream7_IRQHandler           [WEAK]                                          
                EXPORT  FSMC_IRQHandler                   [WEAK]                                             
                EXPORT  SDIO_IRQHandler                   [WEAK]                                             
                EXPORT  TIM5_IRQHandler                   [WEAK]                                             
                EXPORT  SPI3_IRQHandler                   [WEAK]                                             
                EXPORT  UART4_IRQHandler                  [WEAK]                                            
                EXPORT  UART5_IRQHandler                  [WEAK]                                            
                EXPORT  TIM6_IRQHandler               	  [WEAK]                   
                EXPORT  TIM7_IRQHandler                   [WEAK]                    
                EXPORT  TIM9_IRQHandler           		  [WEAK]                                  
                EXPORT  TIM10_IRQHandler           		  [WEAK]                                   
                EXPORT  RFU5_IRQHandler           		  [WEAK]                                    
                EXPORT  VC0_IRQHandler           		  [WEAK]                                    
                EXPORT  VC1_IRQHandler           		  [WEAK]                                 
                EXPORT  VC2_IRQHandler                    [WEAK]                                         
                EXPORT  VC_Wakeup_IRQHandler              [WEAK]                     
                EXPORT  RFU6_IRQHandler                	  [WEAK]                                               
                EXPORT  RFU7_IRQHandler               	  [WEAK]                                               
                EXPORT  RFU8_IRQHandler               	  [WEAK]                                               
                EXPORT  RFU9_IRQHandler               	  [WEAK]                                               
                EXPORT  USB_LP_IRQHandler                 [WEAK]                                       
                EXPORT  USB_HP_IRQHandler           	  [WEAK]                                   
                EXPORT  RFU10_IRQHandler           		  [WEAK]                                   
                EXPORT  RFU11_IRQHandler           		  [WEAK]                                   
                EXPORT  RFU12_IRQHandler                  [WEAK]                                           
                EXPORT  RFU13_IRQHandler                  [WEAK]                                              
                EXPORT  RFU14_IRQHandler                  [WEAK]                                              
                EXPORT  RFU15_IRQHandler         		  [WEAK]                      
                EXPORT  RFU16_IRQHandler          		  [WEAK]                      
                EXPORT  RFU17_IRQHandler            	  [WEAK]                        
                EXPORT  RFU18_IRQHandler                  [WEAK]                                      
                EXPORT  RFU19_IRQHandler                  [WEAK]                                             
                EXPORT  RFU20_IRQHandler                  [WEAK]                                     
                EXPORT  MOU_IRQHandler               	  [WEAK]
                EXPORT  FPU_IRQHandler                    [WEAK]

WWDG_IRQHandler                                                       
PVD_IRQHandler                                      
TAMP_STAMP_IRQHandler                  
RTC_WKUP_IRQHandler                                
FLASH_IRQHandler                                                       
RCC_IRQHandler                                                            
EXTI0_IRQHandler                                                          
EXTI1_IRQHandler                                                           
EXTI2_IRQHandler                                                          
EXTI3_IRQHandler                                                         
EXTI4_IRQHandler                                                          
DMA1_Stream0_IRQHandler                                       
DMA1_Stream1_IRQHandler                                          
DMA1_Stream2_IRQHandler                                          
DMA1_Stream3_IRQHandler                                          
DMA1_Stream4_IRQHandler                                          
DMA1_Stream5_IRQHandler                                          
DMA1_Stream6_IRQHandler                                          
ADC_IRQHandler                                         
RFU1_IRQHandler                                                            
RFU2_IRQHandler                                                          
CAN1_INT0_IRQHandler                                                           
CAN1_INT1_IRQHandler                                                           
EXTI9_5_IRQHandler                                                
TIM1_BRK_IRQHandler                        
TIM1_UP_IRQHandler                      
TIM1_TRG_COM_IRQHandler  
TIM1_CC_IRQHandler                                               
TIM2_IRQHandler                                                           
TIM3_IRQHandler                                                           
TIM4_IRQHandler                                                           
I2C1_EV_IRQHandler                                                         
RFU3_IRQHandler                                                         
I2C2_EV_IRQHandler                                                        
RFU4_IRQHandler                                                           
SPI1_IRQHandler                                                          
SPI2_IRQHandler                                                           
USART1_IRQHandler                                                       
USART2_IRQHandler                                                       
USART3_IRQHandler                                                      
EXTI15_10_IRQHandler                                            
RTC_Alarm_IRQHandler                            
USBWakeUp_IRQHandler                                
TIM8_BRK_IRQHandler                      
TIM8_UP_IRQHandler                       
TIM8_TRG_COM_IRQHandler  
TIM8_CC_IRQHandler                                               
DMA1_Stream7_IRQHandler                                                 
FSMC_IRQHandler                                                            
SDIO_IRQHandler                                                            
TIM5_IRQHandler                                                            
SPI3_IRQHandler                                                            
UART4_IRQHandler                                                          
UART5_IRQHandler                                                          
TIM6_IRQHandler                            
TIM7_IRQHandler                              
TIM9_IRQHandler                                         
TIM10_IRQHandler                                          
RFU5_IRQHandler                                           
VC0_IRQHandler                                           
VC1_IRQHandler                                        
VC2_IRQHandler                                                         
VC_Wakeup_IRQHandler                                
RFU6_IRQHandler                                                           
RFU7_IRQHandler                                                          
RFU8_IRQHandler                                                          
RFU9_IRQHandler                                                          
USB_LP_IRQHandler                                                    
USB_HP_IRQHandler                                          
RFU10_IRQHandler                                          
RFU11_IRQHandler                                          
RFU12_IRQHandler                                                        
RFU13_IRQHandler                                                          
RFU14_IRQHandler                                                          
RFU15_IRQHandler                           
RFU16_IRQHandler                            
RFU17_IRQHandler                                
RFU18_IRQHandler                                                   
RFU19_IRQHandler                                                            
RFU20_IRQHandler                                                    
MOU_IRQHandler
FPU_IRQHandler
   
                B       .

                ENDP

                ALIGN

;*******************************************************************************
; User Stack and Heap initialization
;*******************************************************************************
                 IF      :DEF:__MICROLIB
                
                 EXPORT  __initial_sp
                 EXPORT  __heap_base
                 EXPORT  __heap_limit
                
                 ELSE
                
                 IMPORT  __use_two_region_memory
                 EXPORT  __user_initial_stackheap
                 
__user_initial_stackheap

                 LDR     R0, =  Heap_Mem
                 LDR     R1, =(Stack_Mem + Stack_Size)
                 LDR     R2, = (Heap_Mem +  Heap_Size)
                 LDR     R3, = Stack_Mem
                 BX      LR

                 ALIGN

                 ENDIF

                 END

;*****END OF FILE*****
